#include <stdio.h>
#include <math.h>

int main()
{
    double z1,z2,z2_sux,y,t2_sux,z2_v=0;
    //z1 - окисление в сухом кислороде,первый этап
    //z2 - окисление в влажном кислороде,второй этап
    //z3 - окисление в сухом кислороде,третий этап
    //z2_sux - окисление в сухом кислороде,второй этап
    double t[13],t2[11],t2_k[4];
    int c=1;
    t[0]=0.0166;
    t[1]=0.033;
    t[2]=0.05;
    t[3]=0.067;
    t[4]=0.083;
    t[5]=0.1;
    t[6]=0.117;
    t[7]=0.13;
    t[8]=0.15;
    t[9]=0.167;
    t[10]=0.183;
    t[11]=0.25;

    printf("-----------------------Z1-----------------------\n\n");
    for(int i=0;i<11;++i){
        y = 1.0 + 2.89801458 * t[i];
        z1 = (sqrt(y) - 1) * 0.07435;
        printf("\n %d) z1=%0.10lf pri t=%0.5lf \n", c,z1,t[i]);
        ++c;
    }
    c=1;
    printf("\n\n-----------------------Z1-----------------------\n\n");

    t2[0]=0.83;
    t2[1]=0.85;
    t2[2]=0.88;
    t2[3]=0.883;
    t2[4]=0.9;
    t2[5]=0.92;
    t2[6]=0.933;
    t2[7]=0.95;
    t2[8]=0.967;
    t2[9]=0.983;
    t2[10]=0.85;




    printf("-----------------------Z2-----------------------\n\n");
    for(int j=0;j<11;++j){
        y = 1.0 + 278.02 * t2[j];
        z2 = (sqrt(y) - 1) * 0.09836;
        printf("\n %d) z2=%0.10lf pri t=%0.5lf \n", c,z2,t2[j]);
        ++c;
        if(j==10){z2_v = z2;}
    }
    c=1;
    printf("\n\n-----------------------Z2-----------------------\n\n");

    printf("-----------------------Z2_SUX-----------------------\n\n");

        t2_sux =((((2*z2_v/0.1487)+1)*((2*z2_v/0.1487)+1)-1)*0.1487*0.1487)/0.06408;
        printf("\n z2_sux=%0.10lf\n",t2_sux);
        t2_k[0]=0.231;
        t2_k[1]=0.923;
        t2_k[2]=1.385;
        t2_k[3]=1.846;
        for(int x=0;x<4;++x){
            y = 1.0 + 2.89801458 * t2_k[x];
            z2_sux = (sqrt(y) - 1) * 0.07435;
            printf("\n %d) z2_sux=%0.10lf pri t=%0.5lf \n", c,z2_sux,t2_k[x]);
            ++c;
        }
        y = 1.0 + 2.89801458 * (t2_sux/60);
        z2_sux = (sqrt(y) - 1) * 0.07435;
        printf("\n %d) z2_sux=%0.10lf pri t=%0.5lf \n", c,z2_sux,(t2_sux/60));
        c=1;
    printf("\n\n-----------------------Z2_SUX-----------------------\n\n");


    printf("-----------------------Z3-----------------------\n\n");
    t[12]=0.25;
    for(int i=0;i<11;++i){
        y = 1.0 + 2.89801458 * t[i];
        z1 = (sqrt(y) - 1) * 0.07435;
        printf("\n %d) z1=%0.10lf pri t=%0.5lf \n", c,z1,t[i]);
        ++c;
    }
    y = 1.0 + 2.89801458 *t[12];
    z1 = (sqrt(y) - 1) * 0.07435;
    printf("\n %d) z1=%0.10lf pri t=%0.5lf \n", c,z1,t[12]);
    c=1;
    printf("\n\n-----------------------Z3-----------------------\n\n");




    return 0;
}
